# Tracing the latency of the 5G Registration Procedure with eBPF
>[!NOTE]
> Author: Chia-Hui, Chen
> Date: 2025/12/24
---
## **Overview**
In modern cloud-native architectures, system complexity has reached unprecedented levels. When performance bottlenecks occur in high-performance, high-concurrency systems, developers need tools that can reach deep into the system's lower layers to pinpoint the exact sources of latency. This is where eBPF (extended Berkeley Packet Filter) comes into play.
### Why eBPF?
eBPF allows us to dynamically inject "probes" into both the kernel and user space without modifying the target program's source code or performing a recompilation. For many debugging and optimization scenarios, eBPF serves as an excellent diagnostic tool, offering the following core advantages:

* **Non-intrusive Observation**
    It transparently collects performance data without interfering with the business logic. This means we can perform deep-dive analysis directly in a production environment without worrying about modifying code.

* **A Bridge Between Kernel and User** 
    It doesn't just track user-space function calls via Uprobes; it simultaneously monitors Kprobes (kernel probes) and scheduling events. This cross-layer observability allows for "complete" monitoring of a function's lifecycle — capturing not only its active execution time but also any instances where it was descheduled or blocked by the kernel.


    * **The Impact:** Traditional eBPF tools often use the Thread ID (TID) as a key to store timestamps. If a Goroutine migrates during function execution, the exit probe on Thread B will fail to find the start time recorded by the entry probe on Thread A, leading to broken traces or corrupted data.
    * **Solution:** Instead of relying on TID, we extract the Goid (Goroutine ID) directly from the Go runtime. On x86_64, the g pointer is stored in the R14 register. By reading the goid field from the g struct, we obtain a persistent identifier that follows the Goroutine across different threads. Using Goid as our primary key ensures that our timing remains accurate regardless of thread migration.

    
## **Methodology**

### Locating the Entry and Exit Points of the function
To capture the Entry and Exit Points of the function, we can use `objdump` command to analyze the disassembled binary.
> Note: Function addresses are not fixed and will change every time the program is recompiled. Always re-verify the offsets for your current binary.

Example Command:

``` bash
objdump -d ./amf --disassemble="github.com/free5gc/amf/internal/gmm.HandleRegistrationRequest"
```
The output will be like
![](objdump1.png)
We can use `grep` to quickly find all ret instruction addresses.
``` bash 
objdump -d ./amf --disassemble="github.com/free5gc/amf/internal/gmm.HandleRegistrationRequest" | grep ret
```
![](objdump2.png)
`0xcac2a6` is one of the ret instruction address.
> Note: Every ret instruction within the function must be traced to ensure the exit event is captured regardless of the execution path.

We can use `head -n 10` to find the entry.
``` bash
objdump -d ./amf --disassemble="github.com/free5gc/amf/internal/gmm.HandleRegistrationRequest" | head -n 10
```
![](objdump3.png)
`0xcabf80` is the entry address.

`nm` can also be used to find the entry.
``` bash
nm ./amf | grep -w "github.com/free5gc/amf/internal/gmm.HandleRegistrationRequest"
```
![](nm.png)

> Note: Go's compiler may "inline" small functions for performance. If a function is inlined, it loses its unique symbol and address, making it untraceable via eBPF. To prevent this, you must add the //go:noinline compiler directive directly above the function definition:
``` go
//go:noinline
func YourFunction() { ... }
```
### Get information from Register (ABIInternal)
#### Get goid
To trace Go applications effectively, we need a persistent way to identify a Goroutine as it moves across different OS threads. This is where the Goid comes in. Extracting it requires two pieces of information: the location of the "g" pointer and the memory offset of the goid field.

1. Finding the G-Pointer via R14 
    In the x86_64 architecture, Go’s ABIInternal convention stores the pointer to the current Goroutine structure (runtime.g) in the R14 register.
    * **The Logic:** Whenever an eBPF probe is triggered, we read the value of R14 to get the memory address of the current Goroutine's "home" in memory.
2. Using `pahole` to Locate the Offset
    ```bash
    pahole -C "runtime.g" ./amf
    ```
    the output will be like:
    ```bash
            struct runtime.g {
                runtime.stack              stack;                /*     0    16 */
                uintptr                    stackguard0;          /*    16     8 */
                uintptr                    stackguard1;          /*    24     8 */
                runtime._panic *           _panic;               /*    32     8 */
                runtime._defer *           _defer;               /*    40     8 */
                runtime.m *                m;                    /*    48     8 */
                runtime.gobuf              sched;                /*    56    48 */
                /* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
                uintptr                    syscallsp;            /*   104     8 */
                uintptr                    syscallpc;            /*   112     8 */
                uintptr                    syscallbp;            /*   120     8 */
                /* --- cacheline 2 boundary (128 bytes) --- */
                uintptr                    stktopsp;             /*   128     8 */
                void *                     param;                /*   136     8 */
                internal/runtime/atomic.Uint32 atomicstatus;     /*   144     4 */
                uint32                     stackLock;            /*   148     4 */
                uint64                     goid;                 /*   152     8 */
                runtime.guintptr           schedlink;            /*   160     8 */
                int64                      waitsince;            /*   168     8 */
                runtime.waitReason         waitreason;           /*   176     1 */
                bool                       preempt;              /*   177     1 */
                bool                       preemptStop;          /*   178     1 */
                                            .
                                            .
                                            .
                uint32                     sig;                  /*   220     4 */
                struct []uint8             writebuf;             /*   224    24 */
                uintptr                    sigcode0;             /*   248     8 */
                /* --- cacheline 4 boundary (256 bytes) --- */
                uintptr                    sigcode1;             /*   256     8 */
                uintptr                    sigpc;                /*   264     8 */
                uint64                     parentGoid;           /*   272     8 */
                uintptr                    gopc;                 /*   280     8 */
                                            .
                                            .
                                            .
                /* --- cacheline 6 boundary (384 bytes) --- */
                runtime.synctestBubble *   bubble;               /*   384     8 */
                runtime.gTraceState        trace;                /*   392    32 */
                int64                      gcAssistBytes;        /*   424     8 */
                uintptr                    valgrindStackID;      /*   432     8 */

                /* size: 440, cachelines: 7, members: 61 */
                /* sum members: 439, holes: 1, sum holes: 1 */
                /* last cacheline: 56 bytes */
        };
    ```
    We can find that the offset of goid is 152
    ```bash
    uint64                     goid;                 /*   152     8 */
    ```
    > Note: This offset is version-dependent and should be verified using pahole for your specific Go runtime.
    This tells us that goid is located 152 bytes from the start of the g struct. Therefore, the logic for our BPF program is:$$\text{Goid} = \text{Value at } (R14 + 152)$$
    ``` c
    static __always_inline u64 get_goid(struct pt_regs *ctx) {
        void *g_ptr = (void *)(ctx->r14);
        u64 goid;
        bpf_probe_read_user(&goid, sizeof(goid), (void *)(g_ptr + 152));
        return goid;
    }
    ```
> Note: Go Runtime and all its Goroutines operate entirely in User Space. So we should use `bpf_probe_read_user` to ensures that the data is copied safely from the User Space process into a kernel buffer before we attempt to analyze it.

#### Tracing State Transitions: Capturing casgstatus Arguments
